---------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\situ_\OneDrive\Desktop\RA\COMET\logs\comet_p2_log.txt
  log type:  text
 opened on:  12 Jan 2024, 21:29:23

. 
. use "$data_dir\fake_data.dta", clear

. 
. gen female = sex == "F"

. 
. // Interaction terms //
. reg earnings i.female##c.age

      Source |       SS           df       MS      Number of obs   =   138,138
-------------+----------------------------------   F(3, 138134)    =    192.93
       Model |  3.6836e+13         3  1.2279e+13   Prob > F        =    0.0000
    Residual |  8.7913e+15   138,134  6.3643e+10   R-squared       =    0.0042
-------------+----------------------------------   Adj R-squared   =    0.0042
       Total |  8.8282e+15   138,137  6.3909e+10   Root MSE        =    2.5e+05

------------------------------------------------------------------------------
    earnings |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    1.female |   -55438.2   10194.81    -5.44   0.000    -75419.84   -35456.57
         age |   528.6909   104.5696     5.06   0.000     323.7365    733.6454
             |
female#c.age |
          1  |   467.9059   234.0401     2.00   0.046     9.191859      926.62
             |
       _cons |   68144.75   4870.859    13.99   0.000     58597.96    77691.54
------------------------------------------------------------------------------

.         // prefix factors with i., continuous vars with c., and separate with ##
.         
. reg earnings i.female##i.region

      Source |       SS           df       MS      Number of obs   =   138,138
-------------+----------------------------------   F(9, 138128)    =     60.34
       Model |  3.4570e+13         9  3.8411e+12   Prob > F        =    0.0000
    Residual |  8.7936e+15   138,128  6.3663e+10   R-squared       =    0.0039
-------------+----------------------------------   Adj R-squared   =    0.0039
       Total |  8.8282e+15   138,137  6.3909e+10   Root MSE        =    2.5e+05

-------------------------------------------------------------------------------
     earnings |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     1.female |  -36479.08   2690.343   -13.56   0.000     -41752.1   -31206.06
              |
       region |
           2  |  -455.4176   1974.847    -0.23   0.818    -4326.081    3415.246
           3  |   4273.551   3779.057     1.13   0.258    -3133.329    11680.43
           4  |   -928.814   2481.736    -0.37   0.708    -5792.969    3935.341
           5  |   4948.886   2173.641     2.28   0.023     688.5899    9209.182
              |
female#region |
         1 2  |  -2358.694   4212.676    -0.56   0.576    -10615.46    5898.071
         1 3  |  -7146.386    8432.23    -0.85   0.397     -23673.4    9380.625
         1 4  |   -3191.54   5277.806    -0.60   0.545    -13535.94     7152.86
         1 5  |   71.38841   4528.392     0.02   0.987    -8804.175    8946.952
              |
        _cons |   91593.74   1212.154    75.56   0.000     89217.94    93969.54
-------------------------------------------------------------------------------

. 
. clear*

. sysuse auto, clear
(1978 Automobile Data)

. outreg2 using myfile, sum(log) replace eqdrop(N mean) see

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       price |         74    6165.257    2949.496       3291      15906
         mpg |         74     21.2973    5.785503         12         41
       rep78 |         69    3.405797    .9899323          1          5
    headroom |         74    2.993243    .8459948        1.5          5
       trunk |         74    13.75676    4.277404          5         23
-------------+---------------------------------------------------------
      weight |         74    3019.459    777.1936       1760       4840
      length |         74    187.9324    22.26634        142        233
        turn |         74    39.64865    4.399354         31         51
displacement |         74    197.2973    91.83722         79        425
  gear_ratio |         74    3.014865    .4562871       2.19       3.89
-------------+---------------------------------------------------------
     foreign |         74    .2972973    .4601885          0          1

Following variable is string, not included:  
make  
Hit Enter to continue. exit, clear
--Break--
r(1);

end of do-file

--Break--
r(1);

. exit, clear
